performance/axis2/data/echoMeshInterfaceObjects-100.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:echoMeshInterfaceObjects xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input><ns1:x>0</ns1:x><ns1:y>0</ns1:y><ns1:value>0.0</ns1:value></ns1:input><ns1:input><ns1:x>1</ns1:x><ns1:y>1</ns1:y><ns1:value>1.0</ns1:value></ns1:input><ns1:input><ns1:x>2</ns1:x><ns1:y>2</ns1:y><ns1:value>1.4142135623730951</ns1:value></ns1:input><ns1:input><ns1:x>3</ns1:x><ns1:y>3</ns1:y><ns1:value>1.7320508075688772</ns1:value></ns1:input><ns1:input><ns1:x>4</ns1:x><ns1:y>4</ns1:y><ns1:value>2.0</ns1:value></ns1:input><ns1:input><ns1:x>5</ns1:x><ns1:y>5</ns1:y><ns1:value>2.23606797749979</ns1:value></ns1:input><ns1:input><ns1:x>6</ns1:x><ns1:y>6</ns1:y><ns1:value>2.449489742783178</ns1:value></ns1:input><ns1:input><ns1:x>7</ns1:x><ns1:y>7</ns1:y><ns1:value>2.6457513110645907</ns1:value></ns1:input><ns1:input><ns1:x>8</ns1:x><ns1:y>8</ns1:y><ns1:value>2.8284271247461903</ns1:value></ns1:input><ns1:input><ns1:x>9</ns1:x><ns1:y>9</ns1:y><ns1:value>3.0</ns1:value></ns1:input><ns1:input><ns1:x>10</ns1:x><ns1:y>10</ns1:y><ns1:value>3.1622776601683795</ns1:value></ns1:input><ns1:input><ns1:x>11</ns1:x><ns1:y>11</ns1:y><ns1:value>3.3166247903554</ns1:value></ns1:input><ns1:input><ns1:x>12</ns1:x><ns1:y>12</ns1:y><ns1:value>3.4641016151377544</ns1:value></ns1:input><ns1:input><ns1:x>13</ns1:x><ns1:y>13</ns1:y><ns1:value>3.605551275463989</ns1:value></ns1:input><ns1:input><ns1:x>14</ns1:x><ns1:y>14</ns1:y><ns1:value>3.7416573867739413</ns1:value></ns1:input><ns1:input><ns1:x>15</ns1:x><ns1:y>15</ns1:y><ns1:value>3.872983346207417</ns1:value></ns1:input><ns1:input><ns1:x>16</ns1:x><ns1:y>16</ns1:y><ns1:value>4.0</ns1:value></ns1:input><ns1:input><ns1:x>17</ns1:x><ns1:y>17</ns1:y><ns1:value>4.123105625617661</ns1:value></ns1:input><ns1:input><ns1:x>18</ns1:x><ns1:y>18</ns1:y><ns1:value>4.242640687119285</ns1:value></ns1:input><ns1:input><ns1:x>19</ns1:x><ns1:y>19</ns1:y><ns1:value>4.358898943540674</ns1:value></ns1:input><ns1:input><ns1:x>20</ns1:x><ns1:y>20</ns1:y><ns1:value>4.47213595499958</ns1:value></ns1:input><ns1:input><ns1:x>21</ns1:x><ns1:y>21</ns1:y><ns1:value>4.58257569495584</ns1:value></ns1:input><ns1:input><ns1:x>22</ns1:x><ns1:y>22</ns1:y><ns1:value>4.69041575982343</ns1:value></ns1:input><ns1:input><ns1:x>23</ns1:x><ns1:y>23</ns1:y><ns1:value>4.795831523312719</ns1:value></ns1:input><ns1:input><ns1:x>24</ns1:x><ns1:y>24</ns1:y><ns1:value>4.898979485566356</ns1:value></ns1:input><ns1:input><ns1:x>25</ns1:x><ns1:y>25</ns1:y><ns1:value>5.0</ns1:value></ns1:input><ns1:input><ns1:x>26</ns1:x><ns1:y>26</ns1:y><ns1:value>5.0990195135927845</ns1:value></ns1:input><ns1:input><ns1:x>27</ns1:x><ns1:y>27</ns1:y><ns1:value>5.196152422706632</ns1:value></ns1:input><ns1:input><ns1:x>28</ns1:x><ns1:y>28</ns1:y><ns1:value>5.291502622129181</ns1:value></ns1:input><ns1:input><ns1:x>29</ns1:x><ns1:y>29</ns1:y><ns1:value>5.385164807134504</ns1:value></ns1:input><ns1:input><ns1:x>30</ns1:x><ns1:y>30</ns1:y><ns1:value>5.477225575051661</ns1:value></ns1:input><ns1:input><ns1:x>31</ns1:x><ns1:y>31</ns1:y><ns1:value>5.5677643628300215</ns1:value></ns1:input><ns1:input><ns1:x>32</ns1:x><ns1:y>32</ns1:y><ns1:value>5.656854249492381</ns1:value></ns1:input><ns1:input><ns1:x>33</ns1:x><ns1:y>33</ns1:y><ns1:value>5.744562646538029</ns1:value></ns1:input><ns1:input><ns1:x>34</ns1:x><ns1:y>34</ns1:y><ns1:value>5.830951894845301</ns1:value></ns1:input><ns1:input><ns1:x>35</ns1:x><ns1:y>35</ns1:y><ns1:value>5.916079783099616</ns1:value></ns1:input><ns1:input><ns1:x>36</ns1:x><ns1:y>36</ns1:y><ns1:value>6.0</ns1:value></ns1:input><ns1:input><ns1:x>37</ns1:x><ns1:y>37</ns1:y><ns1:value>6.082762530298219</ns1:value></ns1:input><ns1:input><ns1:x>38</ns1:x><ns1:y>38</ns1:y><ns1:value>6.164414002968976</ns1:value></ns1:input><ns1:input><ns1:x>39</ns1:x><ns1:y>39</ns1:y><ns1:value>6.244997998398398</ns1:value></ns1:input><ns1:input><ns1:x>40</ns1:x><ns1:y>40</ns1:y><ns1:value>6.324555320336759</ns1:value></ns1:input><ns1:input><ns1:x>41</ns1:x><ns1:y>41</ns1:y><ns1:value>6.4031242374328485</ns1:value></ns1:input><ns1:input><ns1:x>42</ns1:x><ns1:y>42</ns1:y><ns1:value>6.48074069840786</ns1:value></ns1:input><ns1:input><ns1:x>43</ns1:x><ns1:y>43</ns1:y><ns1:value>6.557438524302</ns1:value></ns1:input><ns1:input><ns1:x>44</ns1:x><ns1:y>44</ns1:y><ns1:value>6.6332495807108</ns1:value></ns1:input><ns1:input><ns1:x>45</ns1:x><ns1:y>45</ns1:y><ns1:value>6.708203932499369</ns1:value></ns1:input><ns1:input><ns1:x>46</ns1:x><ns1:y>46</ns1:y><ns1:value>6.782329983125268</ns1:value></ns1:input><ns1:input><ns1:x>47</ns1:x><ns1:y>47</ns1:y><ns1:value>6.855654600401044</ns1:value></ns1:input><ns1:input><ns1:x>48</ns1:x><ns1:y>48</ns1:y><ns1:value>6.928203230275509</ns1:value></ns1:input><ns1:input><ns1:x>49</ns1:x><ns1:y>49</ns1:y><ns1:value>7.0</ns1:value></ns1:input><ns1:input><ns1:x>50</ns1:x><ns1:y>50</ns1:y><ns1:value>7.0710678118654755</ns1:value></ns1:input><ns1:input><ns1:x>51</ns1:x><ns1:y>51</ns1:y><ns1:value>7.14142842854285</ns1:value></ns1:input><ns1:input><ns1:x>52</ns1:x><ns1:y>52</ns1:y><ns1:value>7.211102550927978</ns1:value></ns1:input><ns1:input><ns1:x>53</ns1:x><ns1:y>53</ns1:y><ns1:value>7.280109889280518</ns1:value></ns1:input><ns1:input><ns1:x>54</ns1:x><ns1:y>54</ns1:y><ns1:value>7.3484692283495345</ns1:value></ns1:input><ns1:input><ns1:x>55</ns1:x><ns1:y>55</ns1:y><ns1:value>7.416198487095663</ns1:value></ns1:input><ns1:input><ns1:x>56</ns1:x><ns1:y>56</ns1:y><ns1:value>7.483314773547883</ns1:value></ns1:input><ns1:input><ns1:x>57</ns1:x><ns1:y>57</ns1:y><ns1:value>7.54983443527075</ns1:value></ns1:input><ns1:input><ns1:x>58</ns1:x><ns1:y>58</ns1:y><ns1:value>7.615773105863909</ns1:value></ns1:input><ns1:input><ns1:x>59</ns1:x><ns1:y>59</ns1:y><ns1:value>7.681145747868608</ns1:value></ns1:input><ns1:input><ns1:x>60</ns1:x><ns1:y>60</ns1:y><ns1:value>7.745966692414834</ns1:value></ns1:input><ns1:input><ns1:x>61</ns1:x><ns1:y>61</ns1:y><ns1:value>7.810249675906654</ns1:value></ns1:input><ns1:input><ns1:x>62</ns1:x><ns1:y>62</ns1:y><ns1:value>7.874007874011811</ns1:value></ns1:input><ns1:input><ns1:x>63</ns1:x><ns1:y>63</ns1:y><ns1:value>7.937253933193772</ns1:value></ns1:input><ns1:input><ns1:x>64</ns1:x><ns1:y>64</ns1:y><ns1:value>8.0</ns1:value></ns1:input><ns1:input><ns1:x>65</ns1:x><ns1:y>65</ns1:y><ns1:value>8.06225774829855</ns1:value></ns1:input><ns1:input><ns1:x>66</ns1:x><ns1:y>66</ns1:y><ns1:value>8.12403840463596</ns1:value></ns1:input><ns1:input><ns1:x>67</ns1:x><ns1:y>67</ns1:y><ns1:value>8.18535277187245</ns1:value></ns1:input><ns1:input><ns1:x>68</ns1:x><ns1:y>68</ns1:y><ns1:value>8.246211251235321</ns1:value></ns1:input><ns1:input><ns1:x>69</ns1:x><ns1:y>69</ns1:y><ns1:value>8.306623862918075</ns1:value></ns1:input><ns1:input><ns1:x>70</ns1:x><ns1:y>70</ns1:y><ns1:value>8.366600265340756</ns1:value></ns1:input><ns1:input><ns1:x>71</ns1:x><ns1:y>71</ns1:y><ns1:value>8.426149773176359</ns1:value></ns1:input><ns1:input><ns1:x>72</ns1:x><ns1:y>72</ns1:y><ns1:value>8.48528137423857</ns1:value></ns1:input><ns1:input><ns1:x>73</ns1:x><ns1:y>73</ns1:y><ns1:value>8.54400374531753</ns1:value></ns1:input><ns1:input><ns1:x>74</ns1:x><ns1:y>74</ns1:y><ns1:value>8.602325267042627</ns1:value></ns1:input><ns1:input><ns1:x>75</ns1:x><ns1:y>75</ns1:y><ns1:value>8.660254037844387</ns1:value></ns1:input><ns1:input><ns1:x>76</ns1:x><ns1:y>76</ns1:y><ns1:value>8.717797887081348</ns1:value></ns1:input><ns1:input><ns1:x>77</ns1:x><ns1:y>77</ns1:y><ns1:value>8.774964387392123</ns1:value></ns1:input><ns1:input><ns1:x>78</ns1:x><ns1:y>78</ns1:y><ns1:value>8.831760866327848</ns1:value></ns1:input><ns1:input><ns1:x>79</ns1:x><ns1:y>79</ns1:y><ns1:value>8.888194417315589</ns1:value></ns1:input><ns1:input><ns1:x>80</ns1:x><ns1:y>80</ns1:y><ns1:value>8.94427190999916</ns1:value></ns1:input><ns1:input><ns1:x>81</ns1:x><ns1:y>81</ns1:y><ns1:value>9.0</ns1:value></ns1:input><ns1:input><ns1:x>82</ns1:x><ns1:y>82</ns1:y><ns1:value>9.055385138137417</ns1:value></ns1:input><ns1:input><ns1:x>83</ns1:x><ns1:y>83</ns1:y><ns1:value>9.1104335791443</ns1:value></ns1:input><ns1:input><ns1:x>84</ns1:x><ns1:y>84</ns1:y><ns1:value>9.16515138991168</ns1:value></ns1:input><ns1:input><ns1:x>85</ns1:x><ns1:y>85</ns1:y><ns1:value>9.219544457292887</ns1:value></ns1:input><ns1:input><ns1:x>86</ns1:x><ns1:y>86</ns1:y><ns1:value>9.273618495495704</ns1:value></ns1:input><ns1:input><ns1:x>87</ns1:x><ns1:y>87</ns1:y><ns1:value>9.327379053088816</ns1:value></ns1:input><ns1:input><ns1:x>88</ns1:x><ns1:y>88</ns1:y><ns1:value>9.38083151964686</ns1:value></ns1:input><ns1:input><ns1:x>89</ns1:x><ns1:y>89</ns1:y><ns1:value>9.433981132056603</ns1:value></ns1:input><ns1:input><ns1:x>90</ns1:x><ns1:y>90</ns1:y><ns1:value>9.486832980505138</ns1:value></ns1:input><ns1:input><ns1:x>91</ns1:x><ns1:y>91</ns1:y><ns1:value>9.539392014169456</ns1:value></ns1:input><ns1:input><ns1:x>92</ns1:x><ns1:y>92</ns1:y><ns1:value>9.591663046625438</ns1:value></ns1:input><ns1:input><ns1:x>93</ns1:x><ns1:y>93</ns1:y><ns1:value>9.643650760992955</ns1:value></ns1:input><ns1:input><ns1:x>94</ns1:x><ns1:y>94</ns1:y><ns1:value>9.695359714832659</ns1:value></ns1:input><ns1:input><ns1:x>95</ns1:x><ns1:y>95</ns1:y><ns1:value>9.746794344808963</ns1:value></ns1:input><ns1:input><ns1:x>96</ns1:x><ns1:y>96</ns1:y><ns1:value>9.797958971132712</ns1:value></ns1:input><ns1:input><ns1:x>97</ns1:x><ns1:y>97</ns1:y><ns1:value>9.848857801796104</ns1:value></ns1:input><ns1:input><ns1:x>98</ns1:x><ns1:y>98</ns1:y><ns1:value>9.899494936611665</ns1:value></ns1:input><ns1:input><ns1:x>99</ns1:x><ns1:y>99</ns1:y><ns1:value>9.9498743710662</ns1:value></ns1:input></ns1:echoMeshInterfaceObjects></soapenv:Body></soapenv:Envelope>